SasaKaranovic/nRF24L01-PIC16F1829-Temp-and-Humidity-Board/nRF_lib/RF24.c
/*
 Copyright (C) 2011 J. Coliz <maniacbug@ymail.com>

 This program is free software; you can redistribute it and/or
 modify it under the terms of the GNU General Public License
 version 2 as published by the Free Software Foundation.
 */

#include "../main.h"
#include "nRF24L01.h"
#include "RF24_config.h"
#include "RF24.h"
#include "nRF24L01_SK_Conf.h"

/****************************************************************************/

void nrf_csn(int mode)
{
  // Minimum ideal SPI bus speed is 2x data rate
  // If we assume 2Mbs data rate and 16Mhz clock, a
  // divider of 4 is the minimum we want.
  // CLK:BUS 8Mhz:2Mhz, 16Mhz:4Mhz, or 20Mhz:5Mhz
#ifdef ARDUINO
  SPI.setBitOrder(MSBFIRST);
  SPI.setDataMode(SPI_MODE0);
  SPI.setClockDivider(SPI_CLOCK_DIV4);
#endif
  //digitalWrite(csn_pin,mode);
  NRF_CSN = mode;
}

/****************************************************************************/

void nrf_ce(int level)
{
  //digitalWrite(ce_pin,level);
    NRF_CE = level;
}

/****************************************************************************/

uint8_t nrf_read_register_len(uint8_t reg, uint8_t* buf, uint8_t len)
{
  uint8_t status;

  nrf_csn(LOW);
  status = spi_fast_shift( R_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    *buf++ = spi_fast_shift(0xff);

  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_read_register(uint8_t reg)
{
  nrf_csn(LOW);
  spi_fast_shift( R_REGISTER | ( REGISTER_MASK & reg ) );
  uint8_t result = spi_fast_shift(0xff);

  nrf_csn(HIGH);
  return result;
}

/****************************************************************************/

uint8_t nrf_write_register_len(uint8_t reg, const uint8_t* buf, uint8_t len)
{
  uint8_t status;

  nrf_csn(LOW);
  status = spi_fast_shift( W_REGISTER | ( REGISTER_MASK & reg ) );
  while ( len-- )
    spi_fast_shift(*buf++);

  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_write_register(uint8_t reg, uint8_t value)
{
  uint8_t status;

#ifdef IF_SERIAL_DEBUG
    printf("write_register(%02x,%02x)\r\n", reg, value);
#endif


  nrf_csn(LOW);
  status = spi_fast_shift( W_REGISTER | ( REGISTER_MASK & reg ) );
  spi_fast_shift(value);
  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_write_payload(uint8_t *buf, uint8_t len)
{
  uint8_t status;

  //const uint8_t* current = reinterpret_cast<const uint8_t*>(buf);

  uint8_t data_len = min(len, payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  
  //printf("[Writing %u bytes %u blanks]",data_len,blank_len);
  
  uint8_t i=0;
  
  nrf_csn(LOW);
  status = spi_fast_shift( W_TX_PAYLOAD );
  while ( data_len-- ){
    spi_fast_shift((unsigned char) sendPayload[i++]);
  }
  while ( blank_len-- ){
    spi_fast_shift(0);
  }
  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_read_payload(uint8_t *buf, uint8_t len)
{
  uint8_t status;
  //uint8_t* current = reinterpret_cast<uint8_t*>(buf);

  uint8_t data_len = min(len,payload_size);
  uint8_t blank_len = dynamic_payloads_enabled ? 0 : payload_size - data_len;
  
  //printf("[Reading %u bytes %u blanks]",data_len,blank_len);
  uint8_t i =0;
  
  nrf_csn(LOW);
  status = spi_fast_shift( R_RX_PAYLOAD );
  while ( data_len-- )
    buf[i++] = spi_fast_shift(0xff);
  while ( blank_len-- )
    spi_fast_shift(0xff);
  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_flush_rx(void)
{
  uint8_t status;

  nrf_csn(LOW);
  status = spi_fast_shift( FLUSH_RX );
  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_flush_tx(void)
{
  uint8_t status;

  nrf_csn(LOW);
  status = spi_fast_shift( FLUSH_TX );
  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

uint8_t nrf_get_status(void)
{
  uint8_t status;

  nrf_csn(LOW);
  status = spi_fast_shift( NRF_NOP );
  nrf_csn(HIGH);

  return status;
}

/****************************************************************************/

void nrf_print_status(uint8_t status)
{
  printf("STATUS= 0x%02x \r\nRX_DR=%x \r\nTX_DS=%x \r\nMAX_RT=%x \r\nRX_P_NO=%x \r\nTX_FULL=%x\r\n\r\n",
           status,
           (status & _BV(RX_DR))    ?1:0,
           (status & _BV(TX_DS))    ?1:0,
           (status & _BV(MAX_RT))   ?1:0,
           ((status >> RX_P_NO) & 0b00000111),
           (status & _BV(TX_FULL))?1:0
          );
}

/****************************************************************************/

void nrf_print_observe_tx(uint8_t value)
{
  printf_P(PSTR("OBSERVE_TX=%02x: POLS_CNT=%x ARC_CNT=%x\r\n"),
           value,
           (value >> PLOS_CNT) & 0b00001111,
           (value >> ARC_CNT) & 0b00001111
          );
}

/****************************************************************************/

void nrf_print_byte_register(const char* name, uint8_t reg, uint8_t qty)
{
  char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);
  while (qty--)
    printf_P(PSTR(" 0x%02x"), nrf_read_register(reg++));
  printf_P(PSTR("\r\n"));
}

/****************************************************************************/

void nrf_print_address_register(const char* name, uint8_t reg, uint8_t qty)
{
  char extra_tab = strlen_P(name) < 8 ? '\t' : 0;
  printf_P(PSTR(PRIPSTR"\t%c ="),name,extra_tab);

  while (qty--)
  {
    uint8_t buffer[5];
    nrf_read_register_len(reg++,buffer,sizeof buffer);

    printf_P(PSTR(" 0x"));
    uint8_t* bufptr = buffer + sizeof buffer;
    while( --bufptr >= buffer )
      printf_P(PSTR("%02x"),*bufptr);
  }

  printf_P(PSTR("\r\n"));
}

/****************************************************************************/

//RF24::RF24(uint8_t _cepin, uint8_t _cspin):
//  ce_pin(_cepin), csn_pin(_cspin), wide_band(true), p_variant(false), 
//  payload_size(32), ack_payload_available(false), dynamic_payloads_enabled(false),
//  pipe0_reading_address(0)
//{
//}

