SasaKaranovic/nRF24L01-PIC16F1829-Temp-and-Humidity-Board/nRF_lib/RF24.c
/****************************************************************************/

void nrf_setChannel(uint8_t channel)
{
  // TODO: This method could take advantage of the 'wide_band' calculation
  // done in setChannel() to require certain channel spacing.

  const uint8_t max_channel = 127;
  nrf_write_register(RF_CH, min(channel,max_channel));
}

/****************************************************************************/

void nrf_setPayloadSize(uint8_t size)
{
  const uint8_t max_payload_size = 32;
  payload_size = min(size,max_payload_size);
}

/****************************************************************************/

uint8_t nrf_getPayloadSize(void)
{
  return payload_size;
}

/****************************************************************************/

static const char rf24_datarate_e_str_0[] PROGMEM = "1MBPS";
static const char rf24_datarate_e_str_1[] PROGMEM = "2MBPS";
static const char rf24_datarate_e_str_2[] PROGMEM = "250KBPS";
static const char * const rf24_datarate_e_str_P[] PROGMEM = {
  rf24_datarate_e_str_0,
  rf24_datarate_e_str_1,
  rf24_datarate_e_str_2,
};
static const char rf24_model_e_str_0[] PROGMEM = "nRF24L01";
static const char rf24_model_e_str_1[] PROGMEM = "nRF24L01+";
static const char * const rf24_model_e_str_P[] PROGMEM = {
  rf24_model_e_str_0,
  rf24_model_e_str_1,
};
static const char rf24_crclength_e_str_0[] PROGMEM = "Disabled";
static const char rf24_crclength_e_str_1[] PROGMEM = "8 bits";
static const char rf24_crclength_e_str_2[] PROGMEM = "16 bits" ;
static const char * const rf24_crclength_e_str_P[] PROGMEM = {
  rf24_crclength_e_str_0,
  rf24_crclength_e_str_1,
  rf24_crclength_e_str_2,
};
static const char rf24_pa_dbm_e_str_0[] PROGMEM = "PA_MIN";
static const char rf24_pa_dbm_e_str_1[] PROGMEM = "PA_LOW";
static const char rf24_pa_dbm_e_str_2[] PROGMEM = "LA_MED";
static const char rf24_pa_dbm_e_str_3[] PROGMEM = "PA_HIGH";
static const char * const rf24_pa_dbm_e_str_P[] PROGMEM = { 
  rf24_pa_dbm_e_str_0,
  rf24_pa_dbm_e_str_1,
  rf24_pa_dbm_e_str_2,
  rf24_pa_dbm_e_str_3,
};

void nrf_printDetails(void)
{
  nrf_print_status(nrf_get_status());

  nrf_print_address_register("RX_ADDR_P0-1",RX_ADDR_P0,2);
  nrf_print_byte_register("RX_ADDR_P2-5",RX_ADDR_P2,4);
  nrf_print_address_register("TX_ADDR",TX_ADDR, 1);

  nrf_print_byte_register("RX_PW_P0-6",RX_PW_P0,6);
  nrf_print_byte_register("EN_AA",EN_AA, 1);
  nrf_print_byte_register("EN_RXADDR",EN_RXADDR, 1);
  nrf_print_byte_register("RF_CH",RF_CH, 1);
  nrf_print_byte_register("RF_SETUP",RF_SETUP, 1);
  nrf_print_byte_register("CONFIG",CONFIG, 1);
  nrf_print_byte_register("DYNPD/FEATURE",DYNPD,2);

  
  printf("Data Rate\t = ");
  switch(nrf_getDataRate()) {
      case 0:
          printf("1MBPS");
          break;
      case 1:
          printf("2MBPS");
          break;
      case 2:
          printf("250KBPS");
          break;
  }
  
  printf("\r\nCRC Length\t = ");
  switch(nrf_getCRCLength()) {
      case 0:
          printf("Disabled");
          break;
      case 1:
          printf("8 bits");
          break;
      case 2:
          printf("16 bits");
          break;
  }
  
  printf("\r\nPA Power\t\t = ");
  switch(nrf_getPALevel()) {
      case 0:
          printf("PA_MIN\r\n");
          break;
      case 1:
          printf("PA_LOW\r\n");
          break;
      case 2:
          printf("PA_MED\r\n");
          break;
      case 3:
          printf("PA_HIGH\r\n");
          break;
  }
  //printf_P(PSTR("Data Rate\t = %S\r\n"), rf24_datarate_e_str_P[nrf_getDataRate()]);
  //printf_P(PSTR("Model\t\t = %S\r\n"), rf24_model_e_str_P[nrf_isPVariant()]);
  //printf_P(PSTR("CRC Length\t = %S\r\n"), rf24_crclength_e_str_P[nrf_getCRCLength()]);
  //printf_P(PSTR("PA Power\t = %S\r\n"), rf24_pa_dbm_e_str_P[nrf_getPALevel()]);
}

/****************************************************************************/

void nrf_begin(void)
{
  // Initialize pins
  nrf_pinMode(ce_pin,OUTPUT);
  nrf_pinMode(csn_pin,OUTPUT);

  // Initialize SPI bus
  //SPI.begin();
  //Start your SPI before calling this function and you should be fine

  
  nrf_ce(LOW);
  nrf_csn(HIGH);

  // Must allow the radio time to settle else configuration bits will not necessarily stick.
  // This is actually only required following power up but some settling time also appears to
  // be required after resets too. For full coverage, we'll always assume the worst.
  // Enabling 16b CRC is by far the most obvious case if the wrong timing is used - or skipped.
  // Technically we require 4.5ms + 14us as a worst case. We'll just call it 5ms for good measure.
  // WARNING: Delay is based on P-variant whereby non-P *may* require different timing.
  __delay_ms( 5 ) ;

  // Set 1500uS (minimum for 32B payload in ESB@250KBPS) timeouts, to make testing a little easier
  // WARNING: If this is ever lowered, either 250KBS mode with AA is broken or maximum packet
  // sizes must never be used. See documentation for a more complete explanation.
  nrf_write_register(SETUP_RETR,(0b00000100 << ARD) | (0b00001111 << ARC));

  // Restore our default PA level
  nrf_setPALevel( RF24_PA_MAX ) ;

  // Determine if this is a p or non-p RF24 module and then
  // reset our data rate back to default value. This works
  // because a non-P variant won't allow the data rate to
  // be set to 250Kbps.
  if( nrf_setDataRate( RF24_250KBPS ) )
  {
    p_variant = true ;
  }
  
  // Then set the data rate to the slowest (and most reliable) speed supported by all
  // hardware.
  nrf_setDataRate( RF24_1MBPS ) ;

  // Initialize CRC and request 2-byte (16bit) CRC
  nrf_setCRCLength( RF24_CRC_16 ) ;
  
  // Disable dynamic payloads, to match dynamic_payloads_enabled setting
  nrf_write_register(DYNPD,0);

  // Reset current status
  // Notice reset and flush is the last thing we do
  nrf_write_register(STATUS,_BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

  // Set up default configuration.  Callers can always change it later.
  // This channel should be universally safe and not bleed over into adjacent
  // spectrum.
  nrf_setChannel(76);

  // Flush buffers
  nrf_flush_rx();
  nrf_flush_tx();
}

