SasaKaranovic/nRF24L01-PIC16F1829-Temp-and-Humidity-Board/nRF_lib/RF24.c
/****************************************************************************/

void nrf_startListening(void)
{
    nrf_write_register(CONFIG, nrf_read_register(CONFIG) | _BV(PWR_UP) | _BV(PRIM_RX));
    nrf_write_register(STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

    // Restore the pipe0 adddress, if exists
    if (pipe0_reading_address) {
      nrf_write_register_len(RX_ADDR_P0, pipe0_reading_address, 5);
    }
    // Flush buffers
    nrf_flush_rx();
    nrf_flush_tx();

    // Go!
    nrf_ce(HIGH);

    // wait for the radio to come up (130us actually only needed)
    __delay_us(130);
}

/****************************************************************************/

void nrf_stopListening(void)
{
  nrf_ce(LOW);
  nrf_flush_tx();
  nrf_flush_rx();
}

/****************************************************************************/

void nrf_powerDown(void)
{
  nrf_write_register(CONFIG, nrf_read_register(CONFIG) & ~_BV(PWR_UP));
}

/****************************************************************************/

void nrf_powerUp(void)
{
  nrf_write_register(CONFIG, nrf_read_register(CONFIG) | _BV(PWR_UP));
}

/******************************************************************/

bool nrf_write( uint8_t *buf, uint8_t len )
{
  bool result = false;

  // Begin the write
  nrf_startWrite(buf,len);

  // ------------
  // At this point we could return from a non-blocking write, and then call
  // the rest after an interrupt

  // Instead, we are going to block here until we get TX_DS (transmission completed and ack'd)
  // or MAX_RT (maximum retries, transmission failed).  Also, we'll timeout in case the radio
  // is flaky and we get neither.

  // IN the end, the send should be blocking.  It comes back in 60ms worst case, or much faster
  // if I tighted up the retry logic.  (Default settings will be 1500us.
  // Monitor the send
  uint8_t observe_tx;
  uint8_t status;
  //uint32_t sent_at = millis();
  uint32_t timeout = 500000; //ms to wait for timeout
  
  do
  {
    status = nrf_read_register_len(OBSERVE_TX, &observe_tx, 1);
    timeout--;
#ifdef IF_SERIAL_DEBUG
    //printf("0x%02X\r\n", observe_tx);
#endif
    
  }
  while( ! ( status & ( _BV(TX_DS) | _BV(MAX_RT) ) ) && ( timeout > 0) );

  // The part above is what you could recreate with your own interrupt handler,
  // and then call this when you got an interrupt
  // ------------

  // Call this when you get an interrupt
  // The status tells us three things
  // * The send was successful (TX_DS)
  // * The send failed, too many retries (MAX_RT)
  // * There is an ack packet waiting (RX_DR)
  bool tx_ok, tx_fail;
  nrf_whatHappened(&tx_ok, &tx_fail, &ack_payload_available);
  
  //printf("%u%u%u\r\n",tx_ok,tx_fail,ack_payload_available);

  result = tx_ok;
#ifdef IF_SERIAL_DEBUG
    printf(result?"...OK.\r\n":"...Failed\r\n");
#endif

  // Handle the ack packet
  if ( ack_payload_available )
  {
    ack_payload_length = nrf_getDynamicPayloadSize();
#ifdef IF_SERIAL_DEBUG
    printf("\r\n[AckPacket]/\r\n");
#endif
    
#ifdef IF_SERIAL_DEBUG
    printf("\r\n[AckPacket]/\r\n");
#endif

    //IF_SERIAL_DEBUG(printfln(ack_payload_length,DEC));
  }

  // Yay, we are done.

  // Power down
  nrf_powerDown();

  // Flush buffers (Is this a relic of past experimentation, and not needed anymore??)
  nrf_flush_tx();

  return result;
}
/****************************************************************************/

void nrf_startWrite( uint8_t *buf, uint8_t len )
{
  // Transmitter power-up
  nrf_write_register(CONFIG, ( nrf_read_register(CONFIG) | _BV(PWR_UP) ) & ~_BV(PRIM_RX) );
  __delay_us(150);

  // Send the payload
  nrf_write_payload( buf, len );

  // Allons!
  nrf_ce(HIGH);
  __delay_us(15);
  nrf_ce(LOW);
}

/****************************************************************************/

uint8_t nrf_getDynamicPayloadSize(void)
{
  uint8_t result = 0;

  nrf_csn(LOW);
  spi_fast_shift( R_RX_PL_WID );
  result = spi_fast_shift(0xff);
  nrf_csn(HIGH);

  return result;
}

/****************************************************************************/

//bool nrf_available()
//{
//  return nrf_available(NULL);
//}

/****************************************************************************/

bool nrf_available(uint8_t *pipe_num)
{
  uint8_t status = nrf_get_status();

  // Too noisy, enable if you really want lots o data!!
  //IF_SERIAL_DEBUG(print_status(status));

  bool result = ( status & _BV(RX_DR) );

  if (result)
  {
    // If the caller wants the pipe number, include that
    if ( pipe_num )
      *pipe_num = ( status >> RX_P_NO ) & 0b00000111;

    // Clear the status bit

    // ??? Should this REALLY be cleared now?  Or wait until we
    // actually READ the payload?

    nrf_write_register(STATUS,_BV(RX_DR) );

    // Handle ack payload receipt
    if ( status & _BV(TX_DS) )
    {
      nrf_write_register(STATUS,_BV(TX_DS));
    }
  }

  return result;
}

/****************************************************************************/

bool nrf_read( void* buf, uint8_t len )
{
  // Fetch the payload
  nrf_read_payload( buf, len );

  // was this the last of the data available?
  return nrf_read_register(FIFO_STATUS) & _BV(RX_EMPTY);
}

/****************************************************************************/

void nrf_whatHappened(bool *tx_ok,bool *tx_fail,bool *rx_ready)
{
  // Read the status & reset the status in one easy call
  // Or is that such a good idea?
  uint8_t status = nrf_write_register(STATUS, _BV(RX_DR) | _BV(TX_DS) | _BV(MAX_RT) );

  // Report to the user what happened
  *tx_ok = status & _BV(TX_DS);
  *tx_fail = status & _BV(MAX_RT);
  *rx_ready = status & _BV(RX_DR);
}

/****************************************************************************/

void nrf_openWritingPipe(uint8_t *address)
{
  // Note that AVR 8-bit uC's store this LSB first, and the NRF24L01(+)
  // expects it LSB first too, so we're good.

  nrf_write_register_len(RX_ADDR_P0, address, 5);
  nrf_write_register_len(TX_ADDR, address, 5);

  const uint8_t max_payload_size = 32;
  nrf_write_register(RX_PW_P0,min(payload_size,max_payload_size));
}

