SasaKaranovic/nRF24L01-PIC16F1829-Temp-and-Humidity-Board/nRF_lib/RF24.c
/****************************************************************************/

static const uint8_t child_pipe[] PROGMEM =
{
  RX_ADDR_P0, RX_ADDR_P1, RX_ADDR_P2, RX_ADDR_P3, RX_ADDR_P4, RX_ADDR_P5
};
static const uint8_t child_payload_size[] PROGMEM =
{
  RX_PW_P0, RX_PW_P1, RX_PW_P2, RX_PW_P3, RX_PW_P4, RX_PW_P5
};
static const uint8_t child_pipe_enable[] PROGMEM =
{
  ERX_P0, ERX_P1, ERX_P2, ERX_P3, ERX_P4, ERX_P5
};

void nrf_openReadingPipe(uint8_t child, uint8_t *address)
{
  // If this is pipe 0, cache the address.  This is needed because
  // openWritingPipe() will overwrite the pipe 0 address, so
  // startListening() will have to restore it.
  if (child == 0) {
        pipe0_reading_address[0] = address[0];
        pipe0_reading_address[1] = address[1];
        pipe0_reading_address[2] = address[2];
        pipe0_reading_address[3] = address[3];
        pipe0_reading_address[4] = address[4];
  }
  if (child <= 6)
  {
    // For pipes 2-5, only write the LSB
    if ( child < 2 )
      nrf_write_register_len(child_pipe[child], address, 5);
    else
      nrf_write_register_len(child_pipe[child], address, 1);

    nrf_write_register(child_payload_size[child], payload_size);

    // Note it would be more efficient to set all of the bits for all open
    // pipes at once.  However, I thought it would make the calling code
    // more simple to do it this way.
    nrf_write_register(EN_RXADDR, nrf_read_register(EN_RXADDR) | _BV(child_pipe_enable[child]));
  }
}

/****************************************************************************/

void nrf_toggle_features(void)
{
  nrf_csn(LOW);
  spi_fast_shift( ACTIVATE );
  spi_fast_shift( 0x73 );
  nrf_csn(HIGH);
}

/****************************************************************************/

void nrf_enableDynamicPayloads(void)
{
  // Enable dynamic payload throughout the system
  nrf_write_register(FEATURE, nrf_read_register(FEATURE) | _BV(EN_DPL) );

  // If it didn't work, the features are not enabled
  if ( ! nrf_read_register(FEATURE) )
  {
    // So enable them and try again
    nrf_toggle_features();
    nrf_write_register(FEATURE, nrf_read_register(FEATURE) | _BV(EN_DPL) );
  }

#ifdef IF_SERIAL_DEBUG
    printf("FEATURE=%i\r\n", nrf_read_register(FEATURE));
#endif

  // Enable dynamic payload on all pipes
  //
  // Not sure the use case of only having dynamic payload on certain
  // pipes, so the library does not support it.
  nrf_write_register(DYNPD, nrf_read_register(DYNPD) | _BV(DPL_P5) | _BV(DPL_P4) | _BV(DPL_P3) | _BV(DPL_P2) | _BV(DPL_P1) | _BV(DPL_P0));

  dynamic_payloads_enabled = true;
}

/****************************************************************************/

void nrf_enableAckPayload(void)
{
  //
  // enable ack payload and dynamic payload features
  //

  nrf_write_register(FEATURE, nrf_read_register(FEATURE) | _BV(EN_ACK_PAY) | _BV(EN_DPL) );

  // If it didn't work, the features are not enabled
  if ( ! nrf_read_register(FEATURE) )
  {
    // So enable them and try again
    nrf_toggle_features();
    nrf_write_register(FEATURE, nrf_read_register(FEATURE) | _BV(EN_ACK_PAY) | _BV(EN_DPL) );
  }

#ifdef IF_SERIAL_DEBUG
    printf("FEATURE=%i\r\n", nrf_read_register(FEATURE));
#endif

  //
  // Enable dynamic payload on pipes 0 & 1
  //

  nrf_write_register(DYNPD, nrf_read_register(DYNPD) | _BV(DPL_P1) | _BV(DPL_P0));
}

/****************************************************************************/

void nrf_writeAckPayload(uint8_t pipe, const void* buf, uint8_t len)
{
  const uint8_t *current = (buf);

  nrf_csn(LOW);
  spi_fast_shift( W_ACK_PAYLOAD | ( pipe & 0b0111 ) );
  const uint8_t max_payload_size = 32;
  uint8_t data_len = min(len,max_payload_size);
  while ( data_len-- )
    spi_fast_shift(*current++);

  nrf_csn(HIGH);
}

/****************************************************************************/

bool nrf_isAckPayloadAvailable(void)
{
  bool result = ack_payload_available;
  ack_payload_available = false;
  return result;
}

/****************************************************************************/

bool nrf_isPVariant(void)
{
  return p_variant ;
}

/****************************************************************************/

void nrf_setAutoAck_all(bool enable)
{
  if ( enable )
    nrf_write_register(EN_AA, 0b111111);
  else
    nrf_write_register(EN_AA, 0);
}

/****************************************************************************/

void nrf_setAutoAck( uint8_t pipe, bool enable)
{
  if ( pipe <= 6 )
  {
    uint8_t en_aa = nrf_read_register( EN_AA ) ;
    if( enable )
    {
      en_aa |= _BV(pipe) ;
    }
    else
    {
      en_aa &= ~_BV(pipe) ;
    }
    nrf_write_register( EN_AA, en_aa ) ;
  }
}

/****************************************************************************/

bool nrf_testCarrier(void)
{
  return ( nrf_read_register(CD) & 1 );
}

/****************************************************************************/

bool nrf_testRPD(void)
{
  return ( nrf_read_register(RPD) & 1 ) ;
}

/****************************************************************************/

void nrf_setPALevel(rf24_pa_dbm_e level)
{
  uint8_t setup = nrf_read_register(RF_SETUP) ;
  setup &= ~(_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH)) ;

  // switch uses RAM (evil!)
  if ( level == RF24_PA_MAX )
  {
    setup |= (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH)) ;
  }
  else if ( level == RF24_PA_HIGH )
  {
    setup |= _BV(RF_PWR_HIGH) ;
  }
  else if ( level == RF24_PA_LOW )
  {
    setup |= _BV(RF_PWR_LOW);
  }
  else if ( level == RF24_PA_MIN )
  {
    // nothing
  }
  else if ( level == RF24_PA_ERROR )
  {
    // On error, go to maximum PA
    setup |= (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH)) ;
  }

  nrf_write_register( RF_SETUP, setup ) ;
}

/****************************************************************************/

rf24_pa_dbm_e nrf_getPALevel(void)
{
  rf24_pa_dbm_e result = RF24_PA_ERROR ;
  uint8_t power = nrf_read_register(RF_SETUP) & (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH)) ;

  // switch uses RAM (evil!)
  if ( power == (_BV(RF_PWR_LOW) | _BV(RF_PWR_HIGH)) )
  {
    result = RF24_PA_MAX ;
  }
  else if ( power == _BV(RF_PWR_HIGH) )
  {
    result = RF24_PA_HIGH ;
  }
  else if ( power == _BV(RF_PWR_LOW) )
  {
    result = RF24_PA_LOW ;
  }
  else
  {
    result = RF24_PA_MIN ;
  }

